In [36]:
from pyspark.sql import SparkSession

In [37]:
session = SparkSession. \
    builder. \
    appName("Car Sales Analysis"). \
    getOrCreate()

In [38]:
car_sales = session. \
    read. \
    csv('car_sales_2024.csv', 
        header=True, 
        inferSchema=True
    )

In [39]:
car_sales.count()

5000

In [40]:
car_sales.show()

+------------+----------+-----------+---------+---------+--------+--------+------+-------+----------+--------------+----------------+-----------------+-----+----------+
|     sale_id| sale_date|customer_id| car_make|car_model|car_year|category| color|mileage|sale_price|payment_method|      dealership|      salesperson|state|commission|
+------------+----------+-----------+---------+---------+--------+--------+------+-------+----------+--------------+----------------+-----------------+-----+----------+
|SALE20244500|2024-01-01|  CUST14500|    Honda|   Accord|    2023|   Sedan| Black|     16|  29518.87|         Lease|   Westside Auto|   David Anderson|   FL|     850.2|
|SALE20241760|2024-01-01|  CUST11760|      BMW| 3 Series|    2024|  Luxury| Black|     35|  47624.88|       Finance|North Point Cars|     Mary Jackson|   IL|   1012.44|
|SALE20241772|2024-01-01|  CUST11772|    Mazda|     CX-5|    2024|     SUV| White|      8|  31947.14|       Finance| Downtown Motors|      Emily Davis|   PA|    1079.2|
|SALE20241776|2024-01-01|  CUST11776|   Nissan|    Rogue|    2023|     SUV| Brown|     10|   30553.6|         Lease| Downtown Motors|    Sarah Johnson|   PA|   1296.27|
|SALE20242044|2024-01-01|  CUST12044|     Ford|    F-150|    2024|   Truck| White|     23|  46295.44|          Cash| Downtown Motors|     James Thomas|   NC|   1958.91|
|SALE20243788|2024-01-01|  CUST13788|      BMW| 3 Series|    2024|  Luxury|Silver|     18|  43744.49|       Finance|North Point Cars|      Lisa Taylor|   TX|   1847.71|
|SALE20240915|2024-01-01|  CUST10915|  Hyundai|   Sonata|    2024|   Sedan|   Red|     31|  27016.55|          Cash|Eastside Dealers|     James Thomas|   IL|   1268.43|
|SALE20240265|2024-01-01|  CUST10265|    Tesla|  Model Y|    2024|Electric|Silver|     21|  51504.11|       Finance|Eastside Dealers|    Robert Wilson|   TX|   1157.43|
|SALE20244895|2024-01-01|  CUST14895|     Ford|   Escape|    2024|     SUV|   Red|     49|  33379.85|         Lease| Downtown Motors|    Robert Wilson|   IL|   1469.68|
|SALE20243125|2024-01-01|  CUST13125|     Ford| Explorer|    2023|     SUV|Silver|     11|   40110.8|          Cash|Eastside Dealers|      Lisa Taylor|   OH|    1193.6|
|SALE20243354|2024-01-01|  CUST13354|    Honda|   Accord|    2024|   Sedan| Black|     44|  32484.64|       Finance| South Bay Autos|     Mary Jackson|   OH|   1274.86|
|SALE20243303|2024-01-01|  CUST13303|    Tesla|  Model 3|    2023|Electric| Black|     10|  43115.02|          Cash|North Point Cars|Jennifer Martinez|   FL|   1546.21|
|SALE20243216|2024-01-01|  CUST13216|Chevrolet|Silverado|    2023|   Truck|  Gray|      9|  40264.47|         Lease|North Point Cars|      Lisa Taylor|   MI|   1121.22|
|SALE20242767|2024-01-01|  CUST12767|Chevrolet|Silverado|    2024|   Truck| White|     39|  42342.76|       Finance| South Bay Autos|      Lisa Taylor|   NY|    964.65|
|SALE20241381|2024-01-01|  CUST11381|Chevrolet|Silverado|    2024|   Truck|Silver|     28|  41560.48|          Cash| Downtown Motors|      Emily Davis|   NY|    926.09|
|SALE20241425|2024-01-02|  CUST11425|   Toyota|  Corolla|    2024|   Sedan|  Blue|     37|  21731.28|       Finance|North Point Cars|     James Thomas|   MI|    804.57|
|SALE20244138|2024-01-02|  CUST14138|      BMW|       X5|    2024|  Luxury| White|     42|  65107.79|       Finance|Eastside Dealers|Jennifer Martinez|   TX|   2481.34|
|SALE20242677|2024-01-02|  CUST12677|   Toyota|    Camry|    2023|   Sedan|  Gray|     13|  28533.47|       Finance|   Westside Auto|Jennifer Martinez|   GA|   1042.56|
|SALE20240627|2024-01-02|  CUST10627|    Honda|     CR-V|    2023|     SUV| Brown|     49|  33083.67|       Finance| Downtown Motors|    Robert Wilson|   OH|   1301.63|
|SALE20244244|2024-01-02|  CUST14244|    Tesla|  Model Y|    2024|Electric| Brown|     27|  58641.19|       Finance| Downtown Motors|       John Smith|   PA|   2148.09|
+------------+----------+-----------+---------+---------+--------+--------+------+-------+----------+--------------+----------------+-----------------+-----+----------+
only showing top 20 rows

In [41]:
# Get the sales for a given state
state = input("Enter the state: ")
state_sales = car_sales.filter(f"state == '{state}'")

In [42]:
state_sales.count()

538

In [43]:
state_sales.show()

+------------+----------+-----------+---------+---------+--------+--------+-----+-------+----------+--------------+----------------+-----------------+-----+----------+
|     sale_id| sale_date|customer_id| car_make|car_model|car_year|category|color|mileage|sale_price|payment_method|      dealership|      salesperson|state|commission|
+------------+----------+-----------+---------+---------+--------+--------+-----+-------+----------+--------------+----------------+-----------------+-----+----------+
|SALE20244500|2024-01-01|  CUST14500|    Honda|   Accord|    2023|   Sedan|Black|     16|  29518.87|         Lease|   Westside Auto|   David Anderson|   FL|     850.2|
|SALE20243303|2024-01-01|  CUST13303|    Tesla|  Model 3|    2023|Electric|Black|     10|  43115.02|          Cash|North Point Cars|Jennifer Martinez|   FL|   1546.21|
|SALE20240803|2024-01-06|  CUST10803|    Honda|    Civic|    2024|   Sedan|Green|     35|  24368.51|       Finance|North Point Cars|    Sarah Johnson|   FL|   1030.65|
|SALE20244019|2024-01-07|  CUST14019| Mercedes|  C-Class|    2023|  Luxury|Brown|     12|  54959.47|       Finance| South Bay Autos|     Mary Jackson|   FL|   1798.69|
|SALE20240507|2024-01-08|  CUST10507|     Ford|   Escape|    2024|     SUV| Gray|     33|  34201.19|         Lease|   Westside Auto|    Sarah Johnson|   FL|   1573.73|
|SALE20244715|2024-01-08|  CUST14715|    Honda|   Accord|    2023|   Sedan|Black|     20|   28206.1|       Finance|Eastside Dealers|    Robert Wilson|   FL|    957.57|
|SALE20243734|2024-01-09|  CUST13734| Mercedes|      GLE|    2024|  Luxury|White|      5|  62539.57|       Finance| Downtown Motors|   David Anderson|   FL|   1692.85|
|SALE20242792|2024-01-10|  CUST12792|    Honda|   Accord|    2024|   Sedan|Green|     19|  29611.97|       Finance| South Bay Autos|    Robert Wilson|   FL|   1363.09|
|SALE20240576|2024-01-10|  CUST10576|      BMW|       X5|    2024|  Luxury|White|     30|  63685.11|       Finance| Downtown Motors|    Robert Wilson|   FL|   2371.58|
|SALE20241596|2024-01-10|  CUST11596| Mercedes|      GLE|    2024|  Luxury|Brown|     43|  68803.47|         Lease|North Point Cars|       John Smith|   FL|   1513.94|
|SALE20241181|2024-01-12|  CUST11181|Chevrolet|Silverado|    2024|   Truck|Brown|     12|  42451.52|       Finance|   Westside Auto|     James Thomas|   FL|    972.54|
|SALE20240767|2024-01-13|  CUST10767|    Mazda|   Mazda3|    2024|   Sedan|Green|      9|  23385.45|         Lease| Downtown Motors|      Emily Davis|   FL|    906.88|
|SALE20242420|2024-01-13|  CUST12420|  Hyundai|   Tucson|    2023|     SUV|Brown|     47|  33897.78|       Finance| South Bay Autos|    Sarah Johnson|   FL|   1309.03|
|SALE20243901|2024-01-14|  CUST13901|  Hyundai|   Tucson|    2024|     SUV|Brown|     14|  28506.97|       Finance| South Bay Autos|    Michael Brown|   FL|    953.82|
|SALE20240162|2024-01-14|  CUST10162|Chevrolet|   Malibu|    2024|   Sedan|  Red|     10|  27580.91|         Lease|North Point Cars|     James Thomas|   FL|    606.02|
|SALE20242084|2024-01-15|  CUST12084| Mercedes|      GLE|    2024|  Luxury|Black|     48|  67459.22|       Finance| South Bay Autos|    Michael Brown|   FL|   2554.79|
|SALE20244475|2024-01-17|  CUST14475|  Hyundai|   Sonata|    2024|   Sedan|Brown|     37|  25704.03|       Finance|   Westside Auto|    Sarah Johnson|   FL|   1145.91|
|SALE20241757|2024-01-18|  CUST11757|   Toyota|    Camry|    2023|   Sedan|White|     22|  27711.91|         Lease|North Point Cars|   David Anderson|   FL|   1338.59|
|SALE20242701|2024-01-20|  CUST12701|   Toyota|  Corolla|    2024|   Sedan|  Red|     14|  24237.84|       Finance| South Bay Autos|    Michael Brown|   FL|    576.56|
|SALE20244540|2024-01-20|  CUST14540|  Hyundai|   Sonata|    2023|   Sedan|Green|     23|  27282.94|       Finance| South Bay Autos|    Michael Brown|   FL|    694.36|
+------------+----------+-----------+---------+---------+--------+--------+-----+-------+----------+--------------+----------------+-----------------+-----+----------+
only showing top 20 rows

In [49]:
from pyspark.sql.functions import sum, count, round, cast, col

In [50]:
# Get sales by state
sales_by_state = car_sales. \
    withColumn('sale_price', cast('float', col('sale_price'))). \
    groupBy('state'). \
    agg(
        round(sum('sale_price'), 2).alias('total_sales'), \
        count('sale_price').alias('sales_count')
    ). \
    orderBy(col('total_sales').desc())

In [51]:
sales_by_state.count()

10

In [53]:
# Convert to Pandas for better formatting
sales_by_state.toPandas()

  state  total_sales  sales_count
0    FL  20220854.18          538
1    IL  20205300.48          512
2    OH  19920681.73          524
3    NY  19062197.61          508
4    GA  18921434.95          505
5    CA  18727709.11          509
6    TX  18309337.33          489
7    MI  18264746.87          498
8    PA  17866692.35          480
9    NC  16101036.37          437

In [55]:
sales_by_state. \
    orderBy(col('total_sales').desc()). \
    toPandas()

  state  total_sales  sales_count
0    FL  20220854.18          538
1    IL  20205300.48          512
2    OH  19920681.73          524
3    NY  19062197.61          508
4    GA  18921434.95          505
5    CA  18727709.11          509
6    TX  18309337.33          489
7    MI  18264746.87          498
8    PA  17866692.35          480
9    NC  16101036.37          437